Repository: mansoor2016/Safa
Catalog: Safa/Localizable.xcstrings
Source language: en
Languages: ar, bn, fa, fr, id, ms, tr, ur

source: The 10th of Muharram. Fasting this day expiates sins of the previous year.
ar: العاشر من محرم. صيام هذا اليوم يكفّر ذنوب السنة الماضية.
bn: মহররমের ১০ তারিখ। এই দিন রোজা রাখলে পূর্ববর্তী বছরের পাপ মোচন হয়।
fa: ۱۰ محرم. روزه این روز گناهان سال گذشته را پاک می‌کند.
fr: Le 10 de Muharram. Le jeûne de ce jour expie les péchés de l'année précédente.
id: Tanggal 10 Muharram. Berpuasa pada hari ini menghapus dosa tahun sebelumnya.
ms: 10 Muharram. Berpuasa pada hari ini menghapus dosa tahun sebelumnya.
tr: Muharrem'in 10'u. Bu günde oruç tutmak geçen yılın günahlarını bağışlar.
ur: محرم کی 10 تاریخ۔ اس دن روزہ رکھنا پچھلے سال کے گناہوں کو مٹا دیتا ہے۔

source: The AI model is not loaded. Please wait.
ar: نموذج الذكاء الاصطناعي غير محمل. يرجى الانتظار.
bn: AI মডেল লোড হয়নি। অনুগ্রহ করে অপেক্ষা করুন।
fa: مدل هوش مصنوعی بارگذاری نشده است. لطفاً صبر کنید.
fr: Le modèle IA n'est pas chargé. Veuillez patienter.
id: Model AI belum dimuat. Harap tunggu.
ms: Model AI tidak dimuatkan. Sila tunggu.
tr: Yapay zeka modeli yüklenmedi. Lütfen bekleyin.
ur: AI ماڈل لوڈ نہیں ہے۔ براہ کرم انتظار کریں۔

source: The alarm will be set based on Fajr prayer time for your location. You can adjust the offset if needed.
ar: سيُضبط التنبيه بناءً على وقت صلاة الفجر لموقعك. يمكنك ضبط الفارق الزمني إذا لزم الأمر.
bn: আপনার অবস্থানের জন্য ফজর নামাজের সময়ের উপর ভিত্তি করে অ্যালার্ম সেট করা হবে। প্রয়োজনে আপনি অফসেট সমন্বয় করতে পারেন।
fa: زنگ بر اساس زمان نماز فجر برای موقعیت شما تنظیم می‌شود. در صورت نیاز می‌توانید انحراف را تنظیم کنید.
fr: L'alarme sera définie en fonction de l'horaire de la prière Fajr pour votre emplacement. Vous pouvez ajuster le décalage si nécessaire.
id: Alarm akan diatur berdasarkan waktu shalat Subuh untuk lokasi Anda. Anda dapat menyesuaikan offset jika diperlukan.
ms: Penggera akan ditetapkan berdasarkan waktu solat Subuh untuk lokasi anda. Anda boleh laraskan offset jika perlu.
tr: Alarm, konumunuz için Sabah namazı vaktine göre ayarlanacaktır. Gerekirse gecikmeyi/öteleme süresini ayarlayabilirsiniz.
ur: الارم آپ کے مقام کے لیے فجر کی نماز کے وقت کی بنیاد پر سیٹ ہوگا۔ ضرورت ہو تو آپ افسیٹ ایڈجسٹ کر سکتے ہیں۔

source: The beginning of a new Islamic year.
ar: بداية سنة هجرية جديدة.
bn: একটি নতুন ইসলামী বছরের সূচনা।
fa: آغاز سال نو اسلامی.
fr: Le début d'une nouvelle année hégirienne.
id: Awal tahun Hijriah yang baru.
ms: Permulaan tahun Islam baharu.
tr: Yeni bir İslami yılın başlangıcı.
ur: نئے اسلامی سال کی شروعات۔

source: The blessed month of fasting begins.
ar: يبدأ الشهر المبارك للصيام.
bn: রোজার বরকতময় মাস শুরু হয়।
fa: ماه مبارک روزه شروع می‌شود.
fr: Le mois béni du jeûne commence.
id: Bulan suci Ramadan dimulai.
ms: Bulan berpuasa yang diberkati bermula.
tr: Mübarek oruç ayı başlıyor.
ur: روزے کا مبارک مہینہ شروع ہوتا ہے۔

source: The counter announces the current count, target, and percentage complete. The main button describes the dhikr being counted.
ar: يُعلن العداد عن العدد الحالي والهدف والنسبة المئوية المكتملة. الزر الرئيسي يصف الذكر الذي يتم عدّه.
bn: কাউন্টার বর্তমান গণনা, লক্ষ্য এবং শতাংশ সম্পূর্ণ ঘোষণা করে। প্রধান বোতাম যিকির গণনা বর্ণনা করে।
fa: شمارنده تعداد فعلی، هدف و درصد تکمیل را اعلام می‌کند. دکمه اصلی ذکری که شمارش می‌شود را شرح می‌دهد.
fr: Le compteur annonce le comptage actuel, l'objectif et le pourcentage de complétion. Le bouton principal décrit le dhikr compté.
id: Penghitung mengumumkan hitungan saat ini, target, dan persentase selesai. Tombol utama menjelaskan dzikir yang dihitung.
ms: Pengira mengumumkan kiraan semasa, sasaran, dan peratusan selesai. Butang utama menerangkan zikir yang dikira.
tr: Sayaç mevcut sayımı, hedefi ve tamamlanma yüzdesini duyurur. Ana düğme sayılan zikri açıklar.
ur: کاؤنٹر موجودہ گنتی، ہدف اور فیصد مکمل کا اعلان کرتا ہے۔ مرکزی بٹن گنے جانے والے ذکر کی وضاحت کرتا ہے۔

source: The data model could not be found.
ar: تعذر العثور على نموذج البيانات.
bn: ডেটা মডেল পাওয়া যায়নি।
fa: مدل داده یافت نشد.
fr: Le modèle de données est introuvable.
id: Model data tidak dapat ditemukan.
ms: Model data tidak dapat dijumpai.
tr: Veri modeli bulunamadı.
ur: ڈیٹا ماڈل نہیں مل سکا۔

source: The Most Beautiful Names
ar: الأسماء الحسنى
bn: সবচেয়ে সুন্দর নাম
fa: زیباترین نام‌ها
fr: Les Plus Beaux Noms
id: Nama-Nama Yang Indah
ms: Nama-Nama Yang Paling Indah
tr: En Güzel İsimler
ur: سب سے خوبصورت نام

source: The Muslim developer community
ar: مجتمع المطورين المسلمين
bn: মুসলিম ডেভেলপার সম্প্রদায়
fa: جامعه توسعه‌دهندگان مسلمان
fr: La communauté des développeurs musulmans
id: Komunitas pengembang Muslim
ms: Komuniti pembangun Muslim
tr: Müslüman geliştirici topluluğu
ur: مسلم ڈیولپر کمیونٹی

source: The Night Journey and Ascension of Prophet Muhammad ﷺ
ar: رحلة الإسراء والمعراج للنبي محمد ﷺ
bn: নবী মুহাম্মাদ ﷺ এর রাত্রি যাত্রা এবং ঊর্ধ্বারোহণ
fa: سفر شبانه و معراج پیامبر محمد ﷺ
fr: Le Voyage Nocturne et l'Ascension du Prophète Muhammad ﷺ
id: Perjalanan Malam dan Kenaikan Nabi Muhammad ﷺ
ms: Perjalanan Malam dan Kenaikan Nabi Muhammad ﷺ
tr: Hz. Muhammed'in ﷺ Gece Yolculuğu ve Miraca Yükselişi
ur: نبی محمد ﷺ کا سفر اسراء اور معراج

source: The Night of Power.
ar: ليلة القدر.
bn: শবে কদর।
fa: شب قدر.
fr: La Nuit du Destin.
id: Malam Kemuliaan.
ms: Malam Laylatul Qadr.
tr: Kadir Gecesi.
ur: شب قدر۔

source: The required health data type is not available.
ar: نوع البيانات الصحية المطلوب غير متاح.
bn: প্রয়োজনীয় স্বাস্থ্য ডেটা প্রকার উপলব্ধ নেই।
fa: نوع داده سلامتی مورد نیاز در دسترس نیست.
fr: Le type de données de santé requis n'est pas disponible.
id: Jenis data kesehatan yang diperlukan tidak tersedia.
ms: Jenis data kesihatan yang diperlukan tidak tersedia.
tr: Gerekli sağlık verisi türü mevcut değil.
ur: مطلوبہ صحت ڈیٹا کی قسم دستیاب نہیں ہے۔

source: The translation shown alongside Arabic text in the Quran reader
ar: الترجمة المعروضة بجانب النص العربي في قارئ القرآن
bn: কুরআন রিডারে আরবি পাঠ্যের পাশাপাশি দেখানো অনুবাদ
fa: ترجمه نشان داده شده در کنار متن عربی در خواننده قرآن
fr: La traduction affichée à côté du texte arabe dans le lecteur du Coran
id: Terjemahan yang ditampilkan bersama teks Arab di pembaca Al-Quran
ms: Terjemahan yang ditunjukkan bersama teks Arab dalam pembaca Al-Quran
tr: Kur'an okuyucuda Arapça metnin yanında gösterilen meal
ur: قرآن ریڈر میں عربی متن کے ساتھ دکھایا گیا ترجمہ

source: These recommendations are based on common practices in your region. You can always customize these settings to match your preference or local mosque.
ar: هذه التوصيات مبنية على الممارسات الشائعة في منطقتك. يمكنك دائمًا تخصيص هذه الإعدادات لتتناسب مع تفضيلاتك أو مسجدك المحلي.
bn: এই সুপারিশগুলি আপনার অঞ্চলের সাধারণ অনুশীলনের উপর ভিত্তি করে। আপনি সর্বদা আপনার পছন্দ বা স্থানীয় মসজিদের সাথে মেলাতে এই সেটিংস কাস্টমাইজ করতে পারেন।
fa: این پیشنهادها بر اساس رویه‌های رایج در منطقه شما است. همیشه می‌توانید این تنظیمات را متناسب با ترجیح یا مسجد محلی خود سفارشی کنید.
fr: Ces recommandations sont basées sur les pratiques courantes de votre région. Vous pouvez toujours personnaliser ces réglages pour correspondre à votre préférence ou mosquée locale.
id: Rekomendasi ini berdasarkan praktik umum di wilayah Anda. Anda selalu dapat menyesuaikan pengaturan ini agar sesuai dengan preferensi Anda atau masjid setempat.
ms: Cadangan ini berdasarkan amalan biasa di kawasan anda. Anda sentiasa boleh sesuaikan tetapan ini mengikut keutamaan atau masjid tempatan anda.
tr: Bu öneriler bölgenizdeki yaygın uygulamalara dayanmaktadır. Bu ayarları her zaman tercihinize veya yerel caminize uyacak şekilde özelleştirebilirsiniz.
ur: یہ سفارشات آپ کے علاقے میں عام طریقوں پر مبنی ہیں۔ آپ ہمیشہ ان ترتیبات کو اپنی ترجیح یا مقامی مسجد سے ملانے کے لیے اپنی مرضی کے مطابق بنا سکتے ہیں۔

source: This could be the Night of Power. Increase your worship and make dua: اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي
ar: قد تكون هذه ليلة القدر. أكثر من العبادة وادعُ: اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي
bn: এটি শবে কদর হতে পারে। আপনার ইবাদত বৃদ্ধি করুন এবং দোয়া করুন: اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي
fa: این می‌تواند شب قدر باشد. عبادت خود را افزایش دهید و دعا کنید: اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي
fr: Cela pourrait être la Nuit du Destin. Augmentez votre adoration et faites des dou'as : اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي
id: Ini bisa jadi Malam Kemuliaan. Tingkatkan ibadahmu dan berdoa: اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي
ms: Ini mungkin Malam Laylatul Qadr. Tingkatkan ibadah dan berdoa: اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي
tr: Bu Kadir Gecesi olabilir. İbadetini artır ve dua et: اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي
ur: یہ شب قدر ہو سکتی ہے۔ اپنی عبادت بڑھائیں اور دعا کریں: اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي

source: This permanently removes all your data across every category. Your app settings are preserved.
ar: هذا يحذف بشكل دائم جميع بياناتك عبر كل فئة. إعدادات التطبيق محفوظة.
bn: এটি স্থায়ীভাবে প্রতিটি বিভাগ জুড়ে আপনার সমস্ত ডেটা সরিয়ে দেয়। আপনার অ্যাপ সেটিংস সংরক্ষিত থাকে।
fa: این به طور دائم همه داده‌های شما را در هر دسته‌بندی حذف می‌کند. تنظیمات برنامه شما حفظ می‌شوند.
fr: Ceci supprime définitivement toutes vos données dans toutes les catégories. Vos réglages d'application sont préservés.
id: Ini menghapus permanen semua data Anda di setiap kategori. Pengaturan aplikasi Anda tetap tersimpan.
ms: Ini membuang semua data anda merentasi setiap kategori secara kekal. Tetapan aplikasi anda dipelihara.
tr: Bu, her kategorideki tüm verilerinizi kalıcı olarak kaldırır. Uygulama ayarlarınız korunur.
ur: یہ ہر زمرے میں آپ کا تمام ڈیٹا مستقل طور پر ہٹا دیتا ہے۔ آپ کی ایپ کی ترتیبات محفوظ ہیں۔

source: This Week
ar: هذا الأسبوع
bn: এই সপ্তাহ
fa: این هفته
fr: Cette semaine
id: Minggu Ini
ms: Minggu Ini
tr: Bu Hafta
ur: اس ہفتے

source: This will permanently delete all your progress, bookmarks, and chat history. This action cannot be undone.
ar: هذا سيحذف بشكل دائم جميع تقدمك وإشاراتك المرجعية وسجل المحادثات. لا يمكن التراجع عن هذا الإجراء.
bn: এটি স্থায়ীভাবে আপনার সমস্ত অগ্রগতি, বুকমার্ক এবং চ্যাট ইতিহাস মুছে ফেলবে। এই ক্রিয়াটি পূর্বাবস্থায় ফেরানো যাবে না।
fa: این به طور دائم همه پیشرفت، نشانک‌ها و تاریخچه چت شما را حذف می‌کند. این عمل قابل بازگشت نیست.
fr: Ceci supprimera définitivement toute votre progression, vos favoris et votre historique de conversations. Cette action ne peut être annulée.
id: Ini akan menghapus permanen semua kemajuan, penanda, dan riwayat chat Anda. Tindakan ini tidak dapat dibatalkan.
ms: Ini akan memadamkan semua kemajuan, penanda buku, dan sejarah sembang anda secara kekal. Tindakan ini tidak boleh dibuat asal.
tr: Bu, tüm ilerlemenizi, yer imlerinizi ve sohbet geçmişinizi kalıcı olarak silecektir. Bu işlem geri alınamaz.
ur: یہ آپ کی تمام پیش رفت، بک مارکس اور گفتگو کی سرگزشت کو مستقل طور پر حذف کر دے گا۔ یہ عمل کالعدم نہیں کیا جا سکتا۔

source: This will permanently delete all your progress, bookmarks, prayer history, chat history, and more. This action cannot be undone.
ar: هذا سيحذف بشكل دائم جميع تقدمك وإشاراتك المرجعية وسجل الصلاة وسجل المحادثات والمزيد. لا يمكن التراجع عن هذا الإجراء.
bn: এটি স্থায়ীভাবে আপনার সমস্ত অগ্রগতি, বুকমার্ক, নামাজ ইতিহাস, চ্যাট ইতিহাস এবং আরও অনেক কিছু মুছে ফেলবে। এই ক্রিয়াটি পূর্বাবস্থায় ফেরানো যাবে না।
fa: این به طور دائم همه پیشرفت، نشانک‌ها، تاریخچه نماز، تاریخچه چت و بیشتر را حذف می‌کند. این عمل قابل بازگشت نیست.
fr: Ceci supprimera définitivement toute votre progression, vos favoris, votre historique de prière, votre historique de conversations et plus encore. Cette action ne peut être annulée.
id: Ini akan menghapus permanen semua kemajuan, penanda, riwayat shalat, riwayat chat, dan lainnya. Tindakan ini tidak dapat dibatalkan.
ms: Ini akan memadamkan semua kemajuan, penanda buku, sejarah solat, sejarah sembang, dan lagi secara kekal. Tindakan ini tidak boleh dibuat asal.
tr: Bu, tüm ilerlemenizi, yer imlerinizi, namaz geçmişinizi, sohbet geçmişinizi ve daha fazlasını kalıcı olarak silecektir. Bu işlem geri alınamaz.
ur: یہ آپ کی تمام پیش رفت، بک مارکس، نماز کی سرگزشت، گفتگو کی سرگزشت اور مزید کو مستقل طور پر حذف کر دے گا۔ یہ عمل کالعدم نہیں کیا جا سکتا۔

source: This will permanently delete your %@. This action cannot be undone.
ar: هذا سيحذف بشكل دائم %@. لا يمكن التراجع عن هذا الإجراء.
bn: এটি স্থায়ীভাবে আপনার %@ মুছে ফেলবে। এই ক্রিয়াটি পূর্বাবস্থায় ফেরানো যাবে না।
fa: این %@ شما را به طور دائم حذف می‌کند. این عمل قابل بازگشت نیست.
fr: Ceci supprimera définitivement votre %@. Cette action ne peut être annulée.
id: Ini akan menghapus permanen %@ Anda. Tindakan ini tidak dapat dibatalkan.
ms: Ini akan memadamkan %@ anda secara kekal. Tindakan ini tidak boleh dibuat asal.
tr: Bu, %@ kalıcı olarak silecektir. Bu işlem geri alınamaz.
ur: یہ آپ کے %@ کو مستقل طور پر حذف کر دے گا۔ یہ عمل کالعدم نہیں کیا جا سکتا۔

source: This will remove %@ from your device. You can download it again later.
ar: هذا سيزيل %@ من جهازك. يمكنك تنزيله مرة أخرى لاحقًا.
bn: এটি আপনার ডিভাইস থেকে %@ সরিয়ে দেবে। আপনি পরে আবার ডাউনলোড করতে পারবেন।
fa: این %@ را از دستگاه شما حذف می‌کند. می‌توانید بعداً دوباره دانلود کنید.
fr: Ceci supprimera %@ de votre appareil. Vous pouvez le télécharger à nouveau plus tard.
id: Ini akan menghapus %@ dari perangkat Anda. Anda dapat mengunduhnya lagi nanti.
ms: Ini akan membuang %@ dari peranti anda. Anda boleh muat turun semula kemudian.
tr: Bu, %@ cihazınızdan kaldıracaktır. Daha sonra tekrar indirebilirsiniz.
ur: یہ آپ کے ڈیوائس سے %@ کو ہٹا دے گا۔ آپ اسے بعد میں دوبارہ ڈاؤن لوڈ کر سکتے ہیں۔

source: This will remove all downloaded content (%@). You can download content again later.
ar: هذا سيزيل جميع المحتوى المنزّل (%@). يمكنك تنزيل المحتوى مرة أخرى لاحقًا.
bn: এটি সমস্ত ডাউনলোড করা বিষয়বস্তু (%@) সরিয়ে দেবে। আপনি পরে আবার বিষয়বস্তু ডাউনলোড করতে পারবেন।
fa: این همه محتوای دانلود شده (%@) را حذف می‌کند. می‌توانید محتوا را بعداً دوباره دانلود کنید.
fr: Ceci supprimera tout le contenu téléchargé (%@). Vous pouvez télécharger le contenu à nouveau plus tard.
id: Ini akan menghapus semua konten yang diunduh (%@). Anda dapat mengunduh konten lagi nanti.
ms: Ini akan membuang semua kandungan yang dimuat turun (%@). Anda boleh muat turun kandungan semula kemudian.
tr: Bu, tüm indirilen içeriği (%@) kaldıracaktır. İçeriği daha sonra tekrar indirebilirsiniz.
ur: یہ تمام ڈاؤن لوڈ شدہ مواد (%@) کو ہٹا دے گا۔ آپ بعد میں دوبارہ مواد ڈاؤن لوڈ کر سکتے ہیں۔

source: Time for pre-dawn meal. Fajr is in %lld minutes. May your fast be accepted.
ar: وقت وجبة ما قبل الفجر. الفجر خلال %lld دقيقة. تقبل الله صيامك.
bn: ভোরের খাবারের সময়। ফজর %lld মিনিটে। আপনার রোজা কবুল হোক।
fa: وقت غذای قبل از سپیده‌دم. فجر %lld دقیقه دیگر است. روزه شما پذیرفته شود.
fr: L'heure du repas avant l'aube. Fajr dans %lld minutes. Que votre jeûne soit accepté.
id: Waktu makan sahur. Subuh dalam %lld menit. Semoga puasamu diterima.
ms: Waktu makan sahur. Subuh dalam %lld minit. Semoga puasa anda diterima.
tr: Sahur vakti. Sabah namazı %lld dakika sonra. Orucun kabul olsun.
ur: صبح سے پہلے کھانے کا وقت۔ فجر %lld منٹ میں ہے۔ آپ کا روزہ قبول ہو۔

source: Time to pray
ar: حان وقت الصلاة
bn: নামাজের সময় হয়েছে
fa: وقت نماز است
fr: C'est l'heure de prier
id: Waktunya shalat
ms: Waktu untuk solat
tr: Namaz vakti geldi
ur: نماز کا وقت ہو گیا

source: Time to Wind Down
ar: وقت الاستعداد للنوم
bn: বিশ্রামের সময়
fa: وقت آرام‌سازی
fr: Temps de se détendre
id: Waktu untuk Persiapan Tidur
ms: Masa untuk Bertenang
tr: Rahatlama Vakti
ur: آرام کا وقت

source: Time until next prayer
ar: الوقت حتى الصلاة التالية
bn: পরবর্তী নামাজ পর্যন্ত সময়
fa: زمان تا نماز بعدی
fr: Temps jusqu'à la prochaine prière
id: Waktu hingga shalat berikutnya
ms: Masa hingga solat seterusnya
tr: Sonraki namaza kalan süre
ur: اگلی نماز تک کا وقت

source: Tips
ar: النصائح
bn: টিপস
fa: نکات
fr: Conseils
ms: Petua
tr: İpuçları
ur: نکات

source: Title
ar: العنوان
bn: শিরোনাম
fa: عنوان
fr: Titre
id: Judul
ms: Tajuk
tr: Başlık
ur: عنوان

source: To change the app language, go to your device Settings → Safa → Language
ar: لتغيير لغة التطبيق، انتقل إلى إعدادات الجهاز ← Safa ← اللغة
bn: অ্যাপ ভাষা পরিবর্তন করতে, আপনার ডিভাইস সেটিংস → Safa → ভাষা এ যান
fa: برای تغییر زبان برنامه، به تنظیمات دستگاه → Safa → زبان بروید
fr: Pour changer la langue de l'application, allez dans les Réglages de votre appareil → Safa → Langue
id: Untuk mengubah bahasa aplikasi, buka Pengaturan perangkat → Safa → Bahasa
ms: Untuk tukar bahasa aplikasi, pergi ke Tetapan peranti → Safa → Bahasa
tr: Uygulama dilini değiştirmek için cihaz Ayarlar → Safa → Dil'e gidin
ur: ایپ کی زبان تبدیل کرنے کے لیے، اپنے ڈیوائس کی ترتیبات → Safa → Language پر جائیں

source: Today
ar: اليوم
bn: আজ
fa: امروز
fr: Aujourd'hui
id: Hari Ini
ms: Hari Ini
tr: Bugün
ur: آج

source: Today's juz complete — long press to undo
ar: تم إكمال جزء اليوم — اضغط مطولاً للتراجع
bn: আজকের পারা সম্পন্ন — পূর্বাবস্থায় ফেরাতে দীর্ঘ চাপুন
fa: جزء امروز کامل شد — برای لغو طولانی فشار دهید
fr: Juz d’aujourd’hui terminé — appui long pour annuler
id: Juz hari ini selesai — tekan lama untuk membatalkan
ms: Juzuk hari ini selesai — tekan lama untuk buat asal
tr: Bugünkü cüz tamamlandı — geri almak için uzun basın
ur: آج کا پارہ مکمل — واپس کرنے کے لیے دیر تک دبائیں

source: Today's Prayer Times
ar: أوقات الصلاة اليوم
bn: আজকের নামাজের সময়সূচি
fa: اوقات نماز امروز
fr: Horaires de prière d'aujourd'hui
id: Waktu Shalat Hari Ini
ms: Waktu Solat Hari Ini
tr: Bugünün Namaz Vakitleri
ur: آج کے نماز کے اوقات

source: Tonight is the %@ - an odd night
ar: الليلة هي %@ - ليلة فردية
bn: আজ রাতে %@ - একটি বিজোড় রাত
fa: امشب %@ است - یک شب طاق
fr: Ce soir est la %@ - une nuit impaire
id: Malam ini adalah %@ - malam ganjil
ms: Malam ini ialah %@ - malam ganjil
tr: Bu gece %@ - tek gece
ur: آج رات %@ ہے - طاق رات

source: Tonight's Progress
ar: تقدم الليلة
bn: আজ রাতের অগ্রগতি
fa: پیشرفت امشب
fr: Progression de ce soir
id: Kemajuan Malam Ini
ms: Kemajuan Malam Ini
tr: Bu Gecenin İlerlemesi
ur: آج رات کی پیش رفت

source: Total fasting hours
ar: إجمالي ساعات الصيام
bn: মোট রোজার ঘন্টা
fa: مجموع ساعات روزه
fr: Total d'heures de jeûne
id: Total jam puasa
ms: Jumlah jam berpuasa
tr: Toplam oruç saatleri
ur: کل روزے کے اوقات

source: Track your prayers and build consistent habits
ar: تابع صلواتك وابنِ عادات ثابتة
bn: আপনার নামাজ ট্র্যাক করুন এবং ধারাবাহিক অভ্যাস গড়ুন
fa: نمازهایت را پیگیری کن و عادت‌های پایدار بساز
fr: Suivez vos prières et développez des habitudes régulières
id: Lacak shalat Anda dan bangun kebiasaan yang konsisten
ms: Jejaki solat anda dan bina tabiat yang konsisten
tr: Namazlarınızı takip edin ve tutarlı alışkanlıklar geliştirin
ur: اپنی نمازوں کا ریکارڈ رکھیں اور مستقل عادات بنائیں

source: Translation
ar: الترجمة
bn: অনুবাদ
fa: ترجمه
fr: Traduction
id: Terjemahan
ms: Terjemahan
tr: Meal
ur: ترجمہ

source: Translation Text Size
ar: حجم نص الترجمة
bn: অনুবাদ পাঠ্যের আকার
fa: اندازه متن ترجمه
fr: Taille du texte de traduction
id: Ukuran Teks Terjemahan
ms: Saiz Teks Terjemahan
tr: Meal Metin Boyutu
ur: ترجمے کے متن کا سائز

source: Translations are in beta — community-contributed and may be incomplete or contain inaccuracies. English is used where translations are unavailable. Feedback is welcome.
ar: الترجمات تجريبية — من مساهمات المجتمع وقد تكون غير مكتملة أو تحتوي على أخطاء. تُستخدم الإنجليزية عند عدم توفر الترجمة. نرحب بملاحظاتكم.
bn: অনুবাদগুলো বেটায় আছে — কমিউনিটি অবদান এবং অসম্পূর্ণ বা ভুল থাকতে পারে। অনুবাদ না থাকলে ইংরেজি ব্যবহৃত হয়। প্রতিক্রিয়া স্বাগত।
fa: ترجمه‌ها آزمایشی هستند — توسط جامعه ارائه شده و ممکن است ناقص یا نادقیق باشند. در صورت نبود ترجمه، انگلیسی استفاده می‌شود. بازخورد خوش‌آمد است.
fr: Les traductions sont en bêta — contributions communautaires pouvant être incomplètes ou inexactes. L’anglais est utilisé en l’absence de traduction. Vos retours sont les bienvenus.
id: Terjemahan masih beta — kontribusi komunitas dan mungkin tidak lengkap atau mengandung ketidakakuratan. Bahasa Inggris digunakan jika terjemahan tidak tersedia. Masukan Anda diterima.
ms: Terjemahan dalam versi beta — sumbangan komuniti dan mungkin tidak lengkap atau mengandungi ketidaktepatan. Bahasa Inggeris digunakan apabila terjemahan tiada. Maklum balas dialu-alukan.
tr: Çeviriler beta aşamasındadır — topluluk katkılarıdır ve eksik veya hatalı olabilir. Çeviri bulunmadığında İngilizce kullanılır. Geri bildirimlerinizi bekliyoruz.
ur: ترجمے بیٹا میں ہیں — کمیونٹی کی شراکت سے ہیں اور نامکمل یا غلط ہو سکتے ہیں۔ ترجمہ دستیاب نہ ہونے پر انگریزی استعمال ہوتی ہے۔ آراء کا خیرمقدم ہے۔

source: Translations are in beta and may be incomplete. English is used where unavailable.
ar: الترجمات تجريبية وقد تكون غير مكتملة. تُستخدم الإنجليزية عند عدم توفر الترجمة.
bn: অনুবাদগুলো বেটায় আছে এবং অসম্পূর্ণ হতে পারে। অনুবাদ না থাকলে ইংরেজি ব্যবহৃত হয়।
fa: ترجمه‌ها آزمایشی هستند و ممکن است ناقص باشند. در صورت نبود ترجمه، انگلیسی استفاده می‌شود.
fr: Les traductions sont en bêta et peuvent être incomplètes. L’anglais est utilisé en l’absence de traduction.
id: Terjemahan masih beta dan mungkin tidak lengkap. Bahasa Inggris digunakan jika tidak tersedia.
ms: Terjemahan dalam versi beta dan mungkin tidak lengkap. Bahasa Inggeris digunakan apabila tiada.
tr: Çeviriler beta aşamasındadır ve eksik olabilir. Çeviri bulunmadığında İngilizce kullanılır.
ur: ترجمے بیٹا میں ہیں اور نامکمل ہو سکتے ہیں۔ دستیاب نہ ہونے پر انگریزی استعمال ہوتی ہے۔

source: Transliteration
ar: النقل الحرفي
bn: প্রতিবর্ণীকরণ
fa: نسخه‌برداری
fr: Translittération
id: Transliterasi
ms: Transliterasi
tr: Okunuş
ur: نقل حرفی

source: Transliteration Text Size
ar: حجم نص النقل الحرفي
bn: প্রতিবর্ণীকরণ পাঠ্যের আকার
fa: اندازه متن نسخه‌برداری
fr: Taille du texte de translittération
id: Ukuran Teks Transliterasi
ms: Saiz Teks Transliterasi
tr: Okunuş Metin Boyutu
ur: نقل حرفی کے متن کا سائز

source: Triple-tap the version number to hide.
ar: انقر ثلاث مرات على رقم الإصدار للإخفاء.
bn: লুকাতে সংস্করণ নম্বরে ট্রিপল-ট্যাপ করুন।
fa: سه بار روی شماره نسخه ضربه بزنید برای پنهان کردن.
fr: Toucher trois fois le numéro de version pour masquer.
id: Ketuk tiga kali nomor versi untuk sembunyikan.
ms: Ketuk tiga kali nombor versi untuk sembunyikan.
tr: Gizlemek için sürüm numarasına üç kez dokunun.
ur: ورژن نمبر کو چھپانے کے لیے ٹرپل ٹیپ کریں۔

source: Type
ar: النوع
bn: ধরন
fa: نوع
id: Jenis
ms: Jenis
tr: Tür
ur: قسم

source: Unable to determine your location.
ar: تعذر تحديد موقعك.
bn: আপনার অবস্থান নির্ধারণ করতে অক্ষম।
fa: نمی‌توان موقعیت شما را تعیین کرد.
fr: Impossible de déterminer votre emplacement.
id: Tidak dapat menentukan lokasi Anda.
ms: Tidak dapat menentukan lokasi anda.
tr: Konumunuz belirlenemiyor.
ur: آپ کا مقام متعین نہیں کیا جا سکا۔

source: Unable to load surah
ar: تعذر تحميل السورة
bn: সূরা লোড করতে অক্ষম
fa: نمی‌توان سوره را بارگذاری کرد
fr: Impossible de charger la sourate
id: Tidak dapat memuat surah
ms: Tidak dapat memuatkan surah
tr: Sure yüklenemiyor
ur: سورت لوڈ نہیں ہو سکی

source: Unable to load the AI model. Please restart the app and try again.
ar: تعذر تحميل نموذج الذكاء الاصطناعي. يرجى إعادة تشغيل التطبيق والمحاولة مرة أخرى.
bn: AI মডেল লোড করতে অক্ষম। অনুগ্রহ করে অ্যাপ পুনরায় চালু করুন এবং আবার চেষ্টা করুন।
fa: نمی‌توان مدل هوش مصنوعی را بارگذاری کرد. لطفاً برنامه را دوباره راه‌اندازی کنید و دوباره امتحان کنید.
fr: Impossible de charger le modèle IA. Veuillez redémarrer l'application et réessayer.
id: Tidak dapat memuat model AI. Harap restart aplikasi dan coba lagi.
ms: Tidak dapat memuatkan model AI. Sila mulakan semula aplikasi dan cuba lagi.
tr: Yapay zeka modeli yüklenemiyor. Lütfen uygulamayı yeniden başlatın ve tekrar deneyin.
ur: AI ماڈل لوڈ نہیں ہو سکا۔ براہ کرم ایپ دوبارہ شروع کریں اور دوبارہ کوشش کریں۔

source: Undo
ar: تراجع
bn: পূর্বাবস্থায় ফিরুন
fa: لغو
fr: Annuler
id: Batalkan
ms: Buat Asal
tr: Geri Al
ur: کالعدم
